const Filter = require("./models/filter");

const data = [
    "злочин",
    "преступ",
    "зник",
    "пропа",
    "задуш",
    "удуш",
    "інвалід",
    "инвалид",
    "вбив",
    "убив",
    "убил",
    "убийц",
    "жорсток",
    "жесток",
    "педоф",
    "розбещ",
    "розбест",
    "развра",
    "смерт",
    "загин",
    "помер",
    "погиб",
    "заріз",
    "зарез",
    "хвор",
    "болезн",
    "ножем",
    "ножом",
    "викину",
    "выкину",
    "трагед",
    "трагіч",
    "трагич",
    "труї",
    "отрави",
    "ґвалт",
    "гвалт",
    "насилов",
    "діагно",
    "диагно",
    "тіло",
    "тело",
    "бійк",
    "драк",
    "конфликт",
    "конфлікт",
    "алкогол",
    "госпитал",
    "госпітал",
    "задержа",
    "затрима",
    "хулиган",
    "хуліган",
];

const queryArray = data.map(el => {return {text: el}});

Filter.collection.drop()
.then(() => {
    Filter.insertMany(queryArray, function(err, items) {
        console.log(`${items.length} filters created`);
    });
});
