const Filter = require("./models/filter");
const rebuildMatches = require("./gather/rebuildMatches");

const includes = [
    "злочин",
    "преступ",
    "зник",
    "пропа",
    "задуш",
    "удуш",
    "інвалід",
    "инвалид",
    "вбив",
    "убив",
    "убил",
    "убийц",
    "жорсток",
    "жесток",
    "педоф",
    "розбещ",
    "розбест",
    "развра",
    "смерт",
    "загин",
    "помер",
    "погиб",
    "заріз",
    "зарез",
    "хвор",
    "болезн",
    "ножем",
    "ножом",
    "викину",
    "выкину",
    "трагед",
    "трагіч",
    "трагич",
    "труї",
    "отрави",
    "ґвалт",
    "гвалт",
    "насилов",
    "діагно",
    "диагно",
    "тіло",
    "тело",
    "бійк",
    "драк",
    "конфликт",
    "конфлікт",
    "алкогол",
    "госпитал",
    "госпітал",
    "задержа",
    "затрима",
    "хулиган",
    "хуліган",
];

const excludes = [
    "сбу",
    "військ",
    "воєнн",
    "военн",
    "дтп",
    "пішох",
    "пешех",
    "чиновни",
    "водій",
    "водител",
    "збив",
    "сбил",
    "посадов",
    "очільн",
    "глава",
    "воин",
    "спецпризн",
    "спецназ",
    "керівни",
    "начальни",
    "боєць",
    "бійц",
    "боец",
    "аварія",
    "авария"
];

const includeArray = includes.map(el => {return {text: el}});
const excludeArray = excludes.map(el => {return {text: el, isExclude: true}});

Filter.collection.drop()
.then(() => {
    Filter.insertMany([...includeArray, ...excludeArray], function(err, items) {
        console.log(`${items.length} filters created`);
        rebuildMatches();
    });
});
